app/controllers/backoffice/admins_controller.rb

INSERT INTO "admins" ("name", "email", "role", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save

UPDATE "admins" SET "name" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "Paulooooo Melo"], ["updated_at", "2017-07-19 22:26:30.969776"], ["id", 2]]
---
  def update
   if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]
---
  def destroy
    admin_email = @admin.email

   if @admin.destroy