app/controllers/backoffice/games_controller.rb

  def create
    @game = GameService.create(params_game)
---
INSERT INTO "games" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "hahaha"], ["created_at", "2017-07-08 01:14:06.037660"], ["updated_at", "2017-07-08 01:14:06.037660"]]

  def update
   if @game.update(params_game)
---
UPDATE "games" SET "description" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["description", "h"], ["updated_at", "2017-07-08 02:14:32.960015"], ["id", 10]]

def destroy
  game_name = @game.description

  if @game.destroy
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 11]]